УТ_для_edt/src/Catalogs/смартСтатусыRoistat/смартСтатусыRoistat.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартСтатусыRoistat</name>
  <comment>#Б-1538 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Добавить справочник Статусы ROIStat, доработать регистр состояний Интересов</comment>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.смартТипыСтатусовRoistat</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СостоянияИнтересовИУсловия</name>
    <attributes>
      <name>СостояниеИнтереса</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольОплаты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолнаяОплата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДокументыПодписаны</name>
    <comment>//++ #1650 смарт:Шляпников 17.09.2024 //Отметка &quot;Оригиналы документов получены&quot; (Заказ клиента) при частичной отгрузке (1650)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставке</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитанаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеПоТарифу</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСуммаПоТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/смартСтатусыRoistat/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция РассчитатьСтатусRoistatПоСостояниюИнтереса(Интерес, СостояниеИнтереса) Экспорт
	
	СтатусRoistat = Неопределено;

	Если ЗначениеЗаполнено(Интерес) 
		И ЗначениеЗаполнено(СостояниеИнтереса) Тогда
		
		УстановитьПривилегированныйРежим(Истина);	
			
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Журнал.CRM_Интерес КАК Интерес,
			|	СостоянияЗаказов.Заказ,
			|	СостоянияЗаказов.ПроцентОплаты,
			|	СтатусыRoistat.Ссылка КАК СтатусRoistat,
			|	ВЫБОР
			|		КОГДА СтатусыRoistat.КонтрольОплаты ТОГДА
			|			ВЫБОР 
			|				КОГДА 
			|					СтатусыRoistat.ПолнаяОплата 
			|				 		И ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) = 100 ТОГДА 1
			|				КОГДА 
			|					ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) > 0 ТОГДА 2
			|			КОНЕЦ
			|		ИНАЧЕ 3
			|	КОНЕЦ КАК Приоритет
			|ИЗ
			|	РегистрСведений.CRM_ЖурналДокументов КАК Журнал
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказов
			|		ПО СостоянияЗаказов.Заказ = ВЫРАЗИТЬ(Журнал.Объект КАК Документ.ЗаказКлиента)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.смартСтатусыRoistat.СостоянияИнтересовИУсловия КАК СтатусыRoistat
			|		ПО СтатусыRoistat.СостояниеИнтереса = &СостояниеИнтереса
			|			И ВЫБОР
			|					КОГДА СтатусыRoistat.КонтрольОплаты ТОГДА
			|						ВЫБОР КОГДА СтатусыRoistat.ПолнаяОплата ТОГДА 
			|							ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) = 100
			|						ИНАЧЕ 
			|							ЕСТЬNULL(СостоянияЗаказов.ПроцентОплаты, 0) > 0
			|						КОНЕЦ
			|					ИНАЧЕ 
			|						ИСТИНА
			|				КОНЕЦ
			|ГДЕ
			|	Журнал.CRM_Интерес = &Интерес
			|	И Журнал.ГлавнаяЗапись
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет";
		
		Запрос.УстановитьПараметр("Интерес", 		   Интерес);
		Запрос.УстановитьПараметр("СостояниеИнтереса", СостояниеИнтереса);
		
		ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			СтатусRoistat = ВыборкаРезультатаЗапроса.СтатусRoistat;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат СтатусRoistat;
	
КонецФункции	

#КонецОбласти

#КонецЕсли
